<?



//Создать базу данных для чата.check
//
//Создать таблицу для пользователей (users) с полями id, username, password.check
//
//Создать таблицу для сообщений (messages) с полями id, user_id, to_user_id, message.check
//
//Заполнить таблицу пользователей тестовыми данными.check
//
//Подключить базу данных к своему проекту.
//
//Сделай CRUD (Create, Read, Update, Delete) для таблицы users. Пример реализации, можно посмотреть здесь и здесь.
//
//Необязательные дополнительные задачи:
//
//Сделай CRUD (Create, Read, Update, Delete) для таблицы messages.
//
//
phpinfo();
?>